Tests/sysbench_results_r7g.2xlarge_20250606_035531.txt
=====================================================================
SYSBENCH COMPREHENSIVE BENCHMARK RESULTS
=====================================================================
Start Time: Fri Jun  6 03:55:31 UTC 2025
Hostname: ip-172-28-34-204.8067.aws-int.thomsonreuters.com
Instance Type: r7g.2xlarge
Operating System: Linux ip-172-28-34-204.8067.aws-int.thomsonreuters.com 6.1.131-143.221.amzn2023.aarch64 #1 SMP Mon Mar 24 15:34:49 UTC 2025 aarch64 aarch64 aarch64 GNU/Linux
CPU Info: AWS Graviton3
CPU Cores: 8
Memory: 61Gi
=====================================================================

[2025-06-06 03:55:31] Starting Sysbench Comprehensive Benchmark Suite
[2025-06-06 03:55:31] Results will be saved to: sysbench_results_r7g.2xlarge_20250606_035531.txt
[2025-06-06 03:55:31] ================================================
[2025-06-06 03:55:31] Checking prerequisites...
[2025-06-06 03:55:31] k6 found - K6 tests will be included
[SUCCESS] Prerequisites check passed
[2025-06-06 03:55:31] Setting up PostgreSQL database and user...
[SUCCESS] PostgreSQL setup completed
[2025-06-06 03:55:31] Starting CPU benchmarks...
[2025-06-06 03:55:31] Detected 8 CPU cores

=====================================================================
SINGLE-CORE CPU BENCHMARK (10 minutes)
=====================================================================

[2025-06-06 03:55:31] Running single-core CPU benchmark (10 minutes)...
sysbench 1.1.0-3ceba0b (using bundled LuaJIT 2.1.0-beta3)

Running the test with following options:
Number of threads: 1
Report intermediate results every 10 second(s)
Initializing random number generator from current time


Prime numbers limit: 2000

Initializing worker threads...

Threads started!

[ 10s ] thds: 1 eps: 28496.52 lat (ms,95%): 0.04
[ 20s ] thds: 1 eps: 28515.11 lat (ms,95%): 0.04
[ 30s ] thds: 1 eps: 28503.02 lat (ms,95%): 0.04
[ 40s ] thds: 1 eps: 28494.38 lat (ms,95%): 0.04
[ 50s ] thds: 1 eps: 28491.90 lat (ms,95%): 0.04
[ 60s ] thds: 1 eps: 28481.52 lat (ms,95%): 0.04
[ 70s ] thds: 1 eps: 28500.68 lat (ms,95%): 0.04
[ 80s ] thds: 1 eps: 28494.69 lat (ms,95%): 0.04
[ 90s ] thds: 1 eps: 28496.72 lat (ms,95%): 0.04
[ 100s ] thds: 1 eps: 28495.49 lat (ms,95%): 0.04
[ 110s ] thds: 1 eps: 28494.92 lat (ms,95%): 0.04
CPU speed:
    events per second: 28496.89

Throughput:
    events/s (eps):                      28496.8907
    time elapsed:                        120.0002s
    total number of events:              3419632

Latency (ms):
         min:                                    0.03
         avg:                                    0.03
         max:                                    0.20
         95th percentile:                        0.04
         sum:                               119620.05

Threads fairness:
    events (avg/stddev):           3419632.0000/0.00
    execution time (avg/stddev):   119.6200/0.00

[SUCCESS] Single-core CPU benchmark completed

=====================================================================
MULTI-CORE CPU BENCHMARK (10 minutes)
=====================================================================

[2025-06-06 03:57:31] Running multi-core CPU benchmark (10 minutes)...
sysbench 1.1.0-3ceba0b (using bundled LuaJIT 2.1.0-beta3)

Running the test with following options:
Number of threads: 8
Report intermediate results every 10 second(s)
Initializing random number generator from current time


Prime numbers limit: 2000

Initializing worker threads...

Threads started!

[ 10s ] thds: 8 eps: 226580.98 lat (ms,95%): 0.04
[ 20s ] thds: 8 eps: 226889.34 lat (ms,95%): 0.04
[ 30s ] thds: 8 eps: 226436.75 lat (ms,95%): 0.04
[ 40s ] thds: 8 eps: 227047.42 lat (ms,95%): 0.04
[ 50s ] thds: 8 eps: 227049.26 lat (ms,95%): 0.04
[ 60s ] thds: 8 eps: 227016.88 lat (ms,95%): 0.04
[ 70s ] thds: 8 eps: 226787.39 lat (ms,95%): 0.04
[ 80s ] thds: 8 eps: 226967.94 lat (ms,95%): 0.04
[ 90s ] thds: 8 eps: 226908.53 lat (ms,95%): 0.04
[ 100s ] thds: 8 eps: 226480.86 lat (ms,95%): 0.04
[ 110s ] thds: 8 eps: 226890.68 lat (ms,95%): 0.04
CPU speed:
    events per second: 226836.13

Throughput:
    events/s (eps):                      226836.1301
    time elapsed:                        120.0002s
    total number of events:              27220387

Latency (ms):
         min:                                    0.03
         avg:                                    0.04
         max:                                   26.11
         95th percentile:                        0.04
         sum:                               956937.70

Threads fairness:
    events (avg/stddev):           3402548.3750/25380.76
    execution time (avg/stddev):   119.6172/0.01

[SUCCESS] Multi-core CPU benchmark completed
[2025-06-06 03:59:31] Cleaning up PostgreSQL test data...

=====================================================================
POSTGRESQL CLEANUP
=====================================================================

sysbench 1.1.0-3ceba0b (using bundled LuaJIT 2.1.0-beta3)

Dropping table 'sbtest1'...
Dropping table 'sbtest2'...
Dropping table 'sbtest3'...
Dropping table 'sbtest4'...
Dropping table 'sbtest5'...
Dropping table 'sbtest6'...
Dropping table 'sbtest7'...
Dropping table 'sbtest8'...
Dropping table 'sbtest9'...
Dropping table 'sbtest10'...
[SUCCESS] PostgreSQL cleanup completed
[2025-06-06 03:59:31] Preparing PostgreSQL test data...

=====================================================================
POSTGRESQL DATA PREPARATION
=====================================================================

sysbench 1.1.0-3ceba0b (using bundled LuaJIT 2.1.0-beta3)

Creating table 'sbtest1'...
Inserting 1000000 records into 'sbtest1'
Creating a secondary index on 'sbtest1'...
Creating table 'sbtest2'...
Inserting 1000000 records into 'sbtest2'
Creating a secondary index on 'sbtest2'...
Creating table 'sbtest3'...
Inserting 1000000 records into 'sbtest3'
Creating a secondary index on 'sbtest3'...
Creating table 'sbtest4'...
Inserting 1000000 records into 'sbtest4'
Creating a secondary index on 'sbtest4'...
Creating table 'sbtest5'...
Inserting 1000000 records into 'sbtest5'
Creating a secondary index on 'sbtest5'...
Creating table 'sbtest6'...
Inserting 1000000 records into 'sbtest6'
Creating a secondary index on 'sbtest6'...
Creating table 'sbtest7'...
Inserting 1000000 records into 'sbtest7'
Creating a secondary index on 'sbtest7'...
Creating table 'sbtest8'...
Inserting 1000000 records into 'sbtest8'
Creating a secondary index on 'sbtest8'...
Creating table 'sbtest9'...
Inserting 1000000 records into 'sbtest9'
Creating a secondary index on 'sbtest9'...
Creating table 'sbtest10'...
Inserting 1000000 records into 'sbtest10'
Creating a secondary index on 'sbtest10'...
[SUCCESS] PostgreSQL test data preparation completed
[2025-06-06 04:01:19] Starting PostgreSQL benchmarks...

=====================================================================
READ-ONLY BENCHMARK (2 minutes)
=====================================================================

[2025-06-06 04:01:19] Running Read-Only benchmark (2 minutes)...
sysbench 1.1.0-3ceba0b (using bundled LuaJIT 2.1.0-beta3)

Running the test with following options:
Number of threads: 8
Report intermediate results every 10 second(s)
Initializing random number generator from current time


Initializing worker threads...

Threads started!

[ 10s ] thds: 8 tps: 6414.92 qps: 102647.54 (r/w/o: 89816.91/0.00/12830.63) lat (ms,95%): 1.39 err/s: 0.00 reconn/s: 0.00
[ 20s ] thds: 8 tps: 6497.73 qps: 103961.07 (r/w/o: 90965.71/0.00/12995.36) lat (ms,95%): 1.34 err/s: 0.00 reconn/s: 0.00
[ 30s ] thds: 8 tps: 6596.80 qps: 105549.90 (r/w/o: 92356.20/0.00/13193.70) lat (ms,95%): 1.27 err/s: 0.00 reconn/s: 0.00
[ 40s ] thds: 8 tps: 6374.80 qps: 101997.01 (r/w/o: 89247.41/0.00/12749.60) lat (ms,95%): 1.50 err/s: 0.00 reconn/s: 0.00
[ 50s ] thds: 8 tps: 6565.30 qps: 105046.19 (r/w/o: 91915.59/0.00/13130.60) lat (ms,95%): 1.30 err/s: 0.00 reconn/s: 0.00
[ 60s ] thds: 8 tps: 6579.80 qps: 105276.37 (r/w/o: 92116.77/0.00/13159.60) lat (ms,95%): 1.30 err/s: 0.00 reconn/s: 0.00
[ 70s ] thds: 8 tps: 6609.38 qps: 105748.44 (r/w/o: 92529.69/0.00/13218.76) lat (ms,95%): 1.30 err/s: 0.00 reconn/s: 0.00
[ 80s ] thds: 8 tps: 6610.10 qps: 105760.71 (r/w/o: 92540.51/0.00/13220.20) lat (ms,95%): 1.27 err/s: 0.00 reconn/s: 0.00
[ 90s ] thds: 8 tps: 6620.22 qps: 105926.03 (r/w/o: 92685.59/0.00/13240.44) lat (ms,95%): 1.27 err/s: 0.00 reconn/s: 0.00
[ 100s ] thds: 8 tps: 6608.60 qps: 105737.05 (r/w/o: 92519.84/0.00/13217.21) lat (ms,95%): 1.27 err/s: 0.00 reconn/s: 0.00
[ 110s ] thds: 8 tps: 6615.00 qps: 105838.10 (r/w/o: 92608.10/0.00/13230.00) lat (ms,95%): 1.27 err/s: 0.00 reconn/s: 0.00
[ 120s ] thds: 8 tps: 6599.69 qps: 105595.84 (r/w/o: 92396.66/0.00/13199.18) lat (ms,95%): 1.27 err/s: 0.00 reconn/s: 0.00
SQL statistics:
    queries performed:
        read:                            11017090
        write:                           0
        other:                           1573870
        total:                           12590960
    transactions:                        786935 (6557.42 per sec.)
    queries:                             12590960 (104918.66 per sec.)
    ignored errors:                      0      (0.00 per sec.)
    reconnects:                          0      (0.00 per sec.)

Throughput:
    events/s (eps):                      6557.4164
    time elapsed:                        120.0069s
    total number of events:              786935

Latency (ms):
         min:                                    0.75
         avg:                                    1.22
         max:                                   28.24
         95th percentile:                        1.30
         sum:                               959187.02

Threads fairness:
    events (avg/stddev):           98366.8750/1209.13
    execution time (avg/stddev):   119.8984/0.00

[SUCCESS] Read-Only benchmark completed

=====================================================================
WRITE-ONLY BENCHMARK (2 minutes)
=====================================================================

[2025-06-06 04:03:19] Running Write-Only benchmark (2 minutes)...
sysbench 1.1.0-3ceba0b (using bundled LuaJIT 2.1.0-beta3)

Running the test with following options:
Number of threads: 8
Report intermediate results every 10 second(s)
Initializing random number generator from current time


Initializing worker threads...

Threads started!

[ 10s ] thds: 8 tps: 1020.41 qps: 6126.45 (r/w/o: 0.00/4084.83/2041.62) lat (ms,95%): 34.33 err/s: 0.00 reconn/s: 0.00
[ 20s ] thds: 8 tps: 1117.20 qps: 6703.22 (r/w/o: 0.00/4468.81/2234.41) lat (ms,95%): 25.74 err/s: 0.00 reconn/s: 0.00
[ 30s ] thds: 8 tps: 267.80 qps: 1606.80 (r/w/o: 0.00/1071.20/535.60) lat (ms,95%): 40.37 err/s: 0.00 reconn/s: 0.00
[ 40s ] thds: 8 tps: 1134.90 qps: 6809.40 (r/w/o: 0.00/4539.60/2269.80) lat (ms,95%): 25.74 err/s: 0.00 reconn/s: 0.00
[ 50s ] thds: 8 tps: 364.30 qps: 2185.80 (r/w/o: 0.00/1457.20/728.60) lat (ms,95%): 39.65 err/s: 0.00 reconn/s: 0.00
[ 60s ] thds: 8 tps: 1076.70 qps: 6460.20 (r/w/o: 0.00/4306.80/2153.40) lat (ms,95%): 31.37 err/s: 0.00 reconn/s: 0.00
[ 70s ] thds: 8 tps: 486.60 qps: 2919.60 (r/w/o: 0.00/1946.40/973.20) lat (ms,95%): 38.94 err/s: 0.00 reconn/s: 0.00
[ 80s ] thds: 8 tps: 982.00 qps: 5892.00 (r/w/o: 0.00/3928.00/1964.00) lat (ms,95%): 36.89 err/s: 0.00 reconn/s: 0.00
[ 90s ] thds: 8 tps: 563.90 qps: 3383.40 (r/w/o: 0.00/2255.60/1127.80) lat (ms,95%): 38.94 err/s: 0.00 reconn/s: 0.00
[ 100s ] thds: 8 tps: 892.80 qps: 5356.80 (r/w/o: 0.00/3571.20/1785.60) lat (ms,95%): 37.56 err/s: 0.00 reconn/s: 0.00
[ 110s ] thds: 8 tps: 664.80 qps: 3988.80 (r/w/o: 0.00/2659.20/1329.60) lat (ms,95%): 38.25 err/s: 0.00 reconn/s: 0.00
[ 120s ] thds: 8 tps: 788.50 qps: 4729.00 (r/w/o: 0.00/3152.00/1577.00) lat (ms,95%): 38.25 err/s: 0.00 reconn/s: 0.00
SQL statistics:
    queries performed:
        read:                            0
        write:                           374432
        other:                           187216
        total:                           561648
    transactions:                        93608  (779.80 per sec.)
    queries:                             561648 (4678.83 per sec.)
    ignored errors:                      0      (0.00 per sec.)
    reconnects:                          0      (0.00 per sec.)

Throughput:
    events/s (eps):                      779.8042
    time elapsed:                        120.0404s
    total number of events:              93608

Latency (ms):
         min:                                    1.71
         avg:                                   10.26
         max:                                  186.81
         95th percentile:                       37.56
         sum:                               960128.48

Threads fairness:
    events (avg/stddev):           11701.0000/0.71
    execution time (avg/stddev):   120.0161/0.01

[SUCCESS] Write-Only benchmark completed

=====================================================================
READ-WRITE BENCHMARK (2 minutes)
=====================================================================

[2025-06-06 04:05:19] Running Read-Write benchmark (2 minutes)...
sysbench 1.1.0-3ceba0b (using bundled LuaJIT 2.1.0-beta3)

Running the test with following options:
Number of threads: 8
Report intermediate results every 10 second(s)
Initializing random number generator from current time


Initializing worker threads...

Threads started!

[ 10s ] thds: 8 tps: 402.76 qps: 8070.46 (r/w/o: 5649.88/1614.25/806.33) lat (ms,95%): 44.17 err/s: 0.00 reconn/s: 0.00
[ 20s ] thds: 8 tps: 297.60 qps: 5952.02 (r/w/o: 4166.41/1190.40/595.20) lat (ms,95%): 130.13 err/s: 0.00 reconn/s: 0.00
[ 30s ] thds: 8 tps: 408.40 qps: 8166.10 (r/w/o: 5716.20/1633.20/816.70) lat (ms,95%): 34.33 err/s: 0.00 reconn/s: 0.00
[ 40s ] thds: 8 tps: 496.60 qps: 9933.40 (r/w/o: 6953.70/1986.40/993.30) lat (ms,95%): 34.95 err/s: 0.00 reconn/s: 0.00
[ 50s ] thds: 8 tps: 277.40 qps: 5548.50 (r/w/o: 3883.70/1110.00/554.80) lat (ms,95%): 36.89 err/s: 0.00 reconn/s: 0.00
[ 60s ] thds: 8 tps: 818.40 qps: 16367.98 (r/w/o: 11457.59/3273.60/1636.80) lat (ms,95%): 31.37 err/s: 0.00 reconn/s: 0.00
[ 70s ] thds: 8 tps: 266.70 qps: 5334.00 (r/w/o: 3733.80/1066.80/533.40) lat (ms,95%): 39.65 err/s: 0.00 reconn/s: 0.00
[ 80s ] thds: 8 tps: 814.10 qps: 16280.09 (r/w/o: 11397.10/3254.80/1628.20) lat (ms,95%): 35.59 err/s: 0.00 reconn/s: 0.00
[ 90s ] thds: 8 tps: 373.40 qps: 7469.91 (r/w/o: 5227.91/1495.20/746.80) lat (ms,95%): 39.65 err/s: 0.00 reconn/s: 0.00
[ 100s ] thds: 8 tps: 566.00 qps: 11319.99 (r/w/o: 7924.00/2264.00/1132.00) lat (ms,95%): 38.25 err/s: 0.00 reconn/s: 0.00
[ 110s ] thds: 8 tps: 610.90 qps: 12218.00 (r/w/o: 8552.60/2443.60/1221.80) lat (ms,95%): 38.25 err/s: 0.00 reconn/s: 0.00
[ 120s ] thds: 8 tps: 382.30 qps: 7644.18 (r/w/o: 5351.99/1527.60/764.60) lat (ms,95%): 39.65 err/s: 0.00 reconn/s: 0.00
SQL statistics:
    queries performed:
        read:                            800156
        write:                           228616
        other:                           114308
        total:                           1143080
    transactions:                        57154  (476.26 per sec.)
    queries:                             1143080 (9525.11 per sec.)
    ignored errors:                      0      (0.00 per sec.)
    reconnects:                          0      (0.00 per sec.)

Throughput:
    events/s (eps):                      476.2553
    time elapsed:                        120.0071s
    total number of events:              57154

Latency (ms):
         min:                                    1.91
         avg:                                   16.80
         max:                                  183.92
         95th percentile:                       38.25
         sum:                               959935.79

Threads fairness:
    events (avg/stddev):           7144.2500/23.32
    execution time (avg/stddev):   119.9920/0.00

[SUCCESS] Read-Write benchmark completed

=====================================================================
OLTP POINT SELECT BENCHMARK
=====================================================================

[2025-06-06 04:07:19] Running OLTP Point Select benchmark...
sysbench 1.1.0-3ceba0b (using bundled LuaJIT 2.1.0-beta3)

Running the test with following options:
Number of threads: 8
Initializing random number generator from current time


Initializing worker threads...

Threads started!

SQL statistics:
    queries performed:
        read:                            1041085
        write:                           0
        other:                           0
        total:                           1041085
    transactions:                        1041085 (104041.49 per sec.)
    queries:                             1041085 (104041.49 per sec.)
    ignored errors:                      0      (0.00 per sec.)
    reconnects:                          0      (0.00 per sec.)

Throughput:
    events/s (eps):                      104041.4887
    time elapsed:                        10.0064s
    total number of events:              1041085

Latency (ms):
         min:                                    0.03
         avg:                                    0.08
         max:                                   10.29
         95th percentile:                        0.13
         sum:                                79766.90

Threads fairness:
    events (avg/stddev):           130135.6250/2893.79
    execution time (avg/stddev):   9.9709/0.00

[SUCCESS] OLTP Point Select benchmark completed

=====================================================================
OLTP UPDATE INDEX BENCHMARK
=====================================================================

[2025-06-06 04:07:30] Running OLTP Update Index benchmark...
sysbench 1.1.0-3ceba0b (using bundled LuaJIT 2.1.0-beta3)

Running the test with following options:
Number of threads: 8
Initializing random number generator from current time


Initializing worker threads...

Threads started!

SQL statistics:
    queries performed:
        read:                            0
        write:                           12762
        other:                           0
        total:                           12762
    transactions:                        12762  (1267.41 per sec.)
    queries:                             12762  (1267.41 per sec.)
    ignored errors:                      0      (0.00 per sec.)
    reconnects:                          0      (0.00 per sec.)

Throughput:
    events/s (eps):                      1267.4110
    time elapsed:                        10.0693s
    total number of events:              12762

Latency (ms):
         min:                                    1.33
         avg:                                    6.30
         max:                                  168.16
         95th percentile:                       36.24
         sum:                                80413.95

Threads fairness:
    events (avg/stddev):           1595.2500/0.43
    execution time (avg/stddev):   10.0517/0.01

[SUCCESS] OLTP Update Index benchmark completed
[2025-06-06 04:07:40] Starting K6 benchmarks...
[2025-06-06 04:07:40] Truncating cache table...
TRUNCATE TABLE
[SUCCESS] Cache table truncated

=====================================================================
K6 AOT INSERT TEST
=====================================================================

[2025-06-06 04:07:40] Running K6 AOT Insert test...

         /\      Grafana   /‾‾/  
    /\  /  \     |\  __   /  /   
   /  \/    \    | |/ /  /   ‾‾\ 
  /          \   |   (  |  (‾)  |
 / __________ \  |_|\_\  \_____/ 

     execution: local
        script: ./k6/aot/insert-test.js
        output: -

     scenarios: (100.00%) 1 scenario, 80 max VUs, 10m30s max duration (incl. graceful stop):
              * default: 100000 iterations shared among 80 VUs (maxDuration: 10m0s, gracefulStop: 30s)


running (00m01.0s), 80/80 VUs, 11697 complete and 0 interrupted iterations
default   [  12% ] 80 VUs  00m01.0s/10m0s  011697/100000 shared iters

running (00m02.0s), 80/80 VUs, 29992 complete and 0 interrupted iterations
default   [  30% ] 80 VUs  00m02.0s/10m0s  029992/100000 shared iters

running (00m03.0s), 80/80 VUs, 48328 complete and 0 interrupted iterations
default   [  48% ] 80 VUs  00m03.0s/10m0s  048328/100000 shared iters

running (00m04.0s), 80/80 VUs, 66987 complete and 0 interrupted iterations
default   [  67% ] 80 VUs  00m04.0s/10m0s  066987/100000 shared iters

running (00m05.0s), 80/80 VUs, 85151 complete and 0 interrupted iterations
default   [  85% ] 80 VUs  00m05.0s/10m0s  085152/100000 shared iters
time="2025-06-06T04:07:46Z" level=info msg="INFO: Insert test finished." source=console
time="2025-06-06T04:07:46Z" level=info msg="INFO: Teardown cleanup finished." source=console


  █ THRESHOLDS 

    checks{endpoint:postgres_insert}
    ✓ 'rate>0.99' rate=100.00%

    http_req_duration{endpoint:postgres_insert}
    ✓ 'p(95)<300' p(95)=7.32ms

    http_req_failed{endpoint:postgres_insert}
    ✓ 'rate<0.01' rate=0.00%


  █ TOTAL RESULTS 

    checks_total.......................: 100000  17095.611176/s
    checks_succeeded...................: 100.00% 100000 out of 100000
    checks_failed......................: 0.00%   0 out of 100000

    ✓ Postgres: insert status is 200

    HTTP
    http_req_duration...........................................................: avg=4.47ms min=282µs    med=3.92ms max=316.24ms p(90)=6.19ms p(95)=7.32ms
      { endpoint:postgres_insert }..............................................: avg=4.47ms min=282µs    med=3.92ms max=316.24ms p(90)=6.19ms p(95)=7.32ms
      { expected_response:true }................................................: avg=4.47ms min=282µs    med=3.92ms max=316.24ms p(90)=6.19ms p(95)=7.32ms
    http_req_failed.............................................................: 0.00%  0 out of 100001
      { endpoint:postgres_insert }..............................................: 0.00%  0 out of 100000
    http_reqs...................................................................: 100001 17095.782133/s

    EXECUTION
    iteration_duration..........................................................: avg=4.63ms min=337.58µs med=4.02ms max=318.65ms p(90)=6.53ms p(95)=7.8ms 
    iterations..................................................................: 100000 17095.611176/s
    vus.........................................................................: 80     min=80          max=80
    vus_max.....................................................................: 80     min=80          max=80

    NETWORK
    data_received...............................................................: 9.2 MB 1.6 MB/s
    data_sent...................................................................: 26 MB  4.4 MB/s



running (00m05.8s), 00/80 VUs, 100000 complete and 0 interrupted iterations
default ✓ [ 100% ] 80 VUs  00m05.8s/10m0s  100000/100000 shared iters
[SUCCESS] K6 AOT Insert test completed

=====================================================================
K6 AOT QUERY TEST
=====================================================================

[2025-06-06 04:07:46] Running K6 AOT Query test...

         /\      Grafana   /‾‾/  
    /\  /  \     |\  __   /  /   
   /  \/    \    | |/ /  /   ‾‾\ 
  /          \   |   (  |  (‾)  |
 / __________ \  |_|\_\  \_____/ 

     execution: local
        script: ./k6/aot/query-test.js
        output: -

     scenarios: (100.00%) 1 scenario, 80 max VUs, 10m30s max duration (incl. graceful stop):
              * default: 100000 iterations shared among 80 VUs (maxDuration: 10m0s, gracefulStop: 30s)

time="2025-06-06T04:07:46Z" level=info msg="INFO: Setting up 100 keys for query test..." source=console
time="2025-06-06T04:07:46Z" level=info msg="INFO: Setup progress... 10/100 keys inserted." source=console
time="2025-06-06T04:07:46Z" level=info msg="INFO: Setup progress... 20/100 keys inserted." source=console
time="2025-06-06T04:07:46Z" level=info msg="INFO: Setup progress... 30/100 keys inserted." source=console
time="2025-06-06T04:07:46Z" level=info msg="INFO: Setup progress... 40/100 keys inserted." source=console
time="2025-06-06T04:07:46Z" level=info msg="INFO: Setup progress... 50/100 keys inserted." source=console
time="2025-06-06T04:07:46Z" level=info msg="INFO: Setup progress... 60/100 keys inserted." source=console
time="2025-06-06T04:07:46Z" level=info msg="INFO: Setup progress... 70/100 keys inserted." source=console
time="2025-06-06T04:07:46Z" level=info msg="INFO: Setup progress... 80/100 keys inserted." source=console
time="2025-06-06T04:07:46Z" level=info msg="INFO: Setup progress... 90/100 keys inserted." source=console
time="2025-06-06T04:07:46Z" level=info msg="INFO: Setup progress... 100/100 keys inserted." source=console
time="2025-06-06T04:07:46Z" level=info msg="INFO: Setup complete. 100 keys available for querying." source=console

running (00m01.0s), 80/80 VUs, 17505 complete and 0 interrupted iterations
default   [  18% ] 80 VUs  00m00.9s/10m0s  017508/100000 shared iters

running (00m02.0s), 80/80 VUs, 36487 complete and 0 interrupted iterations
default   [  36% ] 80 VUs  00m02.0s/10m0s  036488/100000 shared iters

running (00m03.0s), 80/80 VUs, 55989 complete and 0 interrupted iterations
default   [  56% ] 80 VUs  00m02.9s/10m0s  055989/100000 shared iters

running (00m04.0s), 80/80 VUs, 75887 complete and 0 interrupted iterations
default   [  76% ] 80 VUs  00m03.9s/10m0s  075887/100000 shared iters

running (00m05.0s), 80/80 VUs, 95574 complete and 0 interrupted iterations
default   [  96% ] 80 VUs  00m05.0s/10m0s  095574/100000 shared iters
time="2025-06-06T04:07:51Z" level=info msg="INFO: Query test finished. Tested with 100 keys." source=console
time="2025-06-06T04:07:51Z" level=info msg="INFO: Teardown cleanup finished." source=console


  █ THRESHOLDS 

    checks{endpoint:postgres_get}
    ✓ 'rate>0.99' rate=100.00%

    http_req_duration{endpoint:postgres_get}
    ✓ 'p(95)<300' p(95)=6.91ms

    http_req_failed{endpoint:postgres_get}
    ✓ 'rate<0.01' rate=0.00%


  █ TOTAL RESULTS 

    checks_total.......................: 300000  57465.168326/s
    checks_succeeded...................: 100.00% 300000 out of 300000
    checks_failed......................: 0.00%   0 out of 300000

    ✓ Postgres: get status is 200
    ✓ Postgres: get response has valid status
    ✓ Postgres: get response is valid JSON

    HTTP
    http_req_duration.......................................................: avg=3.93ms min=239.85µs med=3.65ms max=19.25ms p(90)=5.88ms p(95)=6.91ms
      { endpoint:postgres_get }.............................................: avg=3.94ms min=239.85µs med=3.65ms max=19.25ms p(90)=5.88ms p(95)=6.91ms
      { expected_response:true }............................................: avg=3.93ms min=239.85µs med=3.65ms max=19.25ms p(90)=5.88ms p(95)=6.91ms
    http_req_failed.........................................................: 0.00%  0 out of 100101
      { endpoint:postgres_get }.............................................: 0.00%  0 out of 100000
    http_reqs...............................................................: 100101 19174.402715/s

    EXECUTION
    iteration_duration......................................................: avg=4.11ms min=302.4µs  med=3.76ms max=19.37ms p(90)=6.24ms p(95)=7.44ms
    iterations..............................................................: 100000 19155.056109/s
    vus.....................................................................: 80     min=80          max=80
    vus_max.................................................................: 80     min=80          max=80

    NETWORK
    data_received...........................................................: 21 MB  4.1 MB/s
    data_sent...............................................................: 13 MB  2.5 MB/s



running (00m05.2s), 00/80 VUs, 100000 complete and 0 interrupted iterations
default ✓ [ 100% ] 80 VUs  00m05.2s/10m0s  100000/100000 shared iters
[SUCCESS] K6 AOT Query test completed

=====================================================================
K6 NAOT INSERT TEST
=====================================================================

[2025-06-06 04:07:51] Running K6 NAOT Insert test...

         /\      Grafana   /‾‾/  
    /\  /  \     |\  __   /  /   
   /  \/    \    | |/ /  /   ‾‾\ 
  /          \   |   (  |  (‾)  |
 / __________ \  |_|\_\  \_____/ 

     execution: local
        script: ./k6/naot/insert-test.js
        output: -

     scenarios: (100.00%) 1 scenario, 80 max VUs, 10m30s max duration (incl. graceful stop):
              * default: 100000 iterations shared among 80 VUs (maxDuration: 10m0s, gracefulStop: 30s)


running (00m01.0s), 80/80 VUs, 6988 complete and 0 interrupted iterations
default   [   7% ] 80 VUs  00m01.0s/10m0s  006989/100000 shared iters

running (00m02.0s), 80/80 VUs, 19456 complete and 0 interrupted iterations
default   [  19% ] 80 VUs  00m02.0s/10m0s  019456/100000 shared iters

running (00m03.0s), 80/80 VUs, 32033 complete and 0 interrupted iterations
default   [  32% ] 80 VUs  00m03.0s/10m0s  032033/100000 shared iters

running (00m04.0s), 80/80 VUs, 45377 complete and 0 interrupted iterations
default   [  45% ] 80 VUs  00m04.0s/10m0s  045377/100000 shared iters

running (00m05.0s), 80/80 VUs, 61540 complete and 0 interrupted iterations
default   [  62% ] 80 VUs  00m05.0s/10m0s  061540/100000 shared iters

running (00m06.0s), 80/80 VUs, 79985 complete and 0 interrupted iterations
default   [  80% ] 80 VUs  00m06.0s/10m0s  079985/100000 shared iters

running (00m07.0s), 80/80 VUs, 98175 complete and 0 interrupted iterations
default   [  98% ] 80 VUs  00m07.0s/10m0s  098175/100000 shared iters
time="2025-06-06T04:07:58Z" level=info msg="INFO: Insert test finished." source=console
time="2025-06-06T04:07:58Z" level=info msg="INFO: Teardown cleanup finished." source=console


  █ THRESHOLDS 

    checks{endpoint:postgres_insert}
    ✓ 'rate>0.99' rate=100.00%

    http_req_duration{endpoint:postgres_insert}
    ✓ 'p(95)<300' p(95)=9.42ms

    http_req_failed{endpoint:postgres_insert}
    ✓ 'rate<0.01' rate=0.00%


  █ TOTAL RESULTS 

    checks_total.......................: 100000  14038.164674/s
    checks_succeeded...................: 100.00% 100000 out of 100000
    checks_failed......................: 0.00%   0 out of 100000

    ✓ Postgres: insert status is 200

    HTTP
    http_req_duration...........................................................: avg=5.5ms  min=265.86µs med=4.76ms max=414.74ms p(90)=7.94ms p(95)=9.42ms
      { endpoint:postgres_insert }..............................................: avg=5.5ms  min=265.86µs med=4.76ms max=414.74ms p(90)=7.93ms p(95)=9.42ms
      { expected_response:true }................................................: avg=5.5ms  min=265.86µs med=4.76ms max=414.74ms p(90)=7.94ms p(95)=9.42ms
    http_req_failed.............................................................: 0.00%  0 out of 100001
      { endpoint:postgres_insert }..............................................: 0.00%  0 out of 100000
    http_reqs...................................................................: 100001 14038.305056/s

    EXECUTION
    iteration_duration..........................................................: avg=5.65ms min=331.69µs med=4.86ms max=416.8ms  p(90)=8.25ms p(95)=9.83ms
    iterations..................................................................: 100000 14038.164674/s
    vus.........................................................................: 80     min=80          max=80
    vus_max.....................................................................: 80     min=80          max=80

    NETWORK
    data_received...............................................................: 9.2 MB 1.3 MB/s
    data_sent...................................................................: 26 MB  3.6 MB/s



running (00m07.1s), 00/80 VUs, 100000 complete and 0 interrupted iterations
default ✓ [ 100% ] 80 VUs  00m07.1s/10m0s  100000/100000 shared iters
[SUCCESS] K6 NAOT Insert test completed

=====================================================================
K6 NAOT QUERY TEST
=====================================================================

[2025-06-06 04:07:58] Running K6 NAOT Query test...

         /\      Grafana   /‾‾/  
    /\  /  \     |\  __   /  /   
   /  \/    \    | |/ /  /   ‾‾\ 
  /          \   |   (  |  (‾)  |
 / __________ \  |_|\_\  \_____/ 

     execution: local
        script: ./k6/naot/query-test.js
        output: -

     scenarios: (100.00%) 1 scenario, 80 max VUs, 10m30s max duration (incl. graceful stop):
              * default: 100000 iterations shared among 80 VUs (maxDuration: 10m0s, gracefulStop: 30s)

time="2025-06-06T04:07:58Z" level=info msg="INFO: Setting up 100 keys for query test..." source=console
time="2025-06-06T04:07:58Z" level=info msg="INFO: Setup progress... 10/100 keys inserted." source=console
time="2025-06-06T04:07:58Z" level=info msg="INFO: Setup progress... 20/100 keys inserted." source=console
time="2025-06-06T04:07:58Z" level=info msg="INFO: Setup progress... 30/100 keys inserted." source=console
time="2025-06-06T04:07:58Z" level=info msg="INFO: Setup progress... 40/100 keys inserted." source=console
time="2025-06-06T04:07:58Z" level=info msg="INFO: Setup progress... 50/100 keys inserted." source=console
time="2025-06-06T04:07:58Z" level=info msg="INFO: Setup progress... 60/100 keys inserted." source=console
time="2025-06-06T04:07:58Z" level=info msg="INFO: Setup progress... 70/100 keys inserted." source=console
time="2025-06-06T04:07:58Z" level=info msg="INFO: Setup progress... 80/100 keys inserted." source=console
time="2025-06-06T04:07:58Z" level=info msg="INFO: Setup progress... 90/100 keys inserted." source=console
time="2025-06-06T04:07:58Z" level=info msg="INFO: Setup progress... 100/100 keys inserted." source=console
time="2025-06-06T04:07:58Z" level=info msg="INFO: Setup complete. 100 keys available for querying." source=console

running (00m01.0s), 80/80 VUs, 15591 complete and 0 interrupted iterations
default   [  16% ] 80 VUs  00m01.0s/10m0s  015591/100000 shared iters

running (00m02.0s), 80/80 VUs, 34513 complete and 0 interrupted iterations
default   [  35% ] 80 VUs  00m02.0s/10m0s  034515/100000 shared iters

running (00m03.0s), 80/80 VUs, 53611 complete and 0 interrupted iterations
default   [  54% ] 80 VUs  00m03.0s/10m0s  053612/100000 shared iters

running (00m04.0s), 80/80 VUs, 72180 complete and 0 interrupted iterations
default   [  72% ] 80 VUs  00m04.0s/10m0s  072180/100000 shared iters

running (00m05.0s), 80/80 VUs, 91215 complete and 0 interrupted iterations
default   [  91% ] 80 VUs  00m05.0s/10m0s  091217/100000 shared iters
time="2025-06-06T04:08:04Z" level=info msg="INFO: Query test finished. Tested with 100 keys." source=console
time="2025-06-06T04:08:04Z" level=info msg="INFO: Teardown cleanup finished." source=console


  █ THRESHOLDS 

    checks{endpoint:postgres_get}
    ✓ 'rate>0.99' rate=100.00%

    http_req_duration{endpoint:postgres_get}
    ✓ 'p(95)<300' p(95)=7.19ms

    http_req_failed{endpoint:postgres_get}
    ✓ 'rate<0.01' rate=0.00%


  █ TOTAL RESULTS 

    checks_total.......................: 300000  55123.196235/s
    checks_succeeded...................: 100.00% 300000 out of 300000
    checks_failed......................: 0.00%   0 out of 300000

    ✓ Postgres: get status is 200
    ✓ Postgres: get response has valid status
    ✓ Postgres: get response is valid JSON

    HTTP
    http_req_duration.......................................................: avg=4.11ms min=254.03µs med=3.82ms max=36.7ms  p(90)=6.08ms p(95)=7.19ms
      { endpoint:postgres_get }.............................................: avg=4.12ms min=254.03µs med=3.82ms max=36.7ms  p(90)=6.08ms p(95)=7.19ms
      { expected_response:true }............................................: avg=4.11ms min=254.03µs med=3.82ms max=36.7ms  p(90)=6.08ms p(95)=7.19ms
    http_req_failed.........................................................: 0.00%  0 out of 100101
      { endpoint:postgres_get }.............................................: 0.00%  0 out of 100000
    http_reqs...............................................................: 100101 18392.956888/s

    EXECUTION
    iteration_duration......................................................: avg=4.29ms min=312.89µs med=3.92ms max=38.51ms p(90)=6.43ms p(95)=7.74ms
    iterations..............................................................: 100000 18374.398745/s
    vus.....................................................................: 80     min=80          max=80
    vus_max.................................................................: 80     min=80          max=80

    NETWORK
    data_received...........................................................: 21 MB  3.9 MB/s
    data_sent...............................................................: 13 MB  2.4 MB/s



running (00m05.4s), 00/80 VUs, 100000 complete and 0 interrupted iterations
default ✓ [ 100% ] 80 VUs  00m05.4s/10m0s  100000/100000 shared iters
[SUCCESS] K6 NAOT Query test completed
[SUCCESS] All available K6 benchmarks completed
[2025-06-06 04:08:04] Cleaning up PostgreSQL test data...

=====================================================================
POSTGRESQL CLEANUP
=====================================================================

sysbench 1.1.0-3ceba0b (using bundled LuaJIT 2.1.0-beta3)

Dropping table 'sbtest1'...
Dropping table 'sbtest2'...
Dropping table 'sbtest3'...
Dropping table 'sbtest4'...
Dropping table 'sbtest5'...
Dropping table 'sbtest6'...
Dropping table 'sbtest7'...
Dropping table 'sbtest8'...
Dropping table 'sbtest9'...
Dropping table 'sbtest10'...
[SUCCESS] PostgreSQL cleanup completed

=====================================================================
BENCHMARK COMPLETION
=====================================================================
End Time: Fri Jun  6 04:08:04 UTC 2025
Duration: 12 minutes and 34 seconds
Results saved to: sysbench_results_r7g.2xlarge_20250606_035531.txt
=====================================================================
[2025-06-06 04:08:04] ================================================
[SUCCESS] All benchmarks completed successfully!
[2025-06-06 04:08:04] Detailed results saved to: sysbench_results_r7g.2xlarge_20250606_035531.txt